console.log(`Выполненная самопроверка первой части задания "Shelter":
Страница Main +60
    * Header +10
        + Интерактивная навигация, подсвечен элемент "About the shelter."
        + Нажатие на Our pets перебрасывает нас на страницу our pets.
        + Нажатие на Help the shelter перебрасывает нас на блок Help.
        + Нажатие на Contacts перебрасывает нас на блок Footer.
        + Логотип состоит из текстовых элементов. Нажатие на логотип оставляет нас на текущей странице.
        + На странице единственный элемент <h1> — с текстом "Cozy House" в логотипе.
        + Хедер при скролле остаётся на своей позиции.
    * Not only / Welcome +5
        + Кнопка "Make a Friend" интерактивна.
        + Нажатие на Make a Friend перебрасывает нас на блок Our Friends.
        + Фон блоков задан градиентом.
        + Картинка собаки и текст — разные блоки, не накладываются друг на друга.
    * About +5
        + Заданы верные кавычки в заголовке
        + Изображение и текст являются разными блоками и не накладываются друг на друга.
        + Соблюдена заданная в макете структура расположения элементов.
    * Our Friends +20
        + Кнопки "влево" и "вправо" интерактивны.
        + Карточки расположены флексами, пропорции и сеточная структура соответствуют макету.
        + Карточки с питомцами интерактивны. Наведение на карточку меняет курсор, делает подсветку кнопки Learn more и меняет фон.
        + Кнопки Learn more имеют дополнительную интерактивность.
        + Кнопка Get to know the rest интерактивна и перебрасывает нас на страницу our pets.
    * Help +5
        + Для позиционирования элементов использованы флексы.
        + Расположение элементов: 5 сверху, 4 снизу.
        + Пропорции элементов и сеточная структура соответствуют макету.
    * In addition +5
        + Блок с номером банковского счёта интерактивный, является отключённой ссылкой.
        + Картинка собаки и текст являются отдельными блоками, позиционирование блоков соответствуют макету.
    * Footer +10
        + При нажатии на email или иконку открывается почтовый сервис.
        + При нажатии на телефон или иконку открывается набор номера.
        + При нажатии на локации открывается google maps.
        + Изображение собаки, адреса и контакты — разные блоки, блоки спозиционированы согласно макету.
        + Фон выполнен с использованием градиента.
Страница Our Pets +40
    * Header +10
        + Панель навигации интерактивна, подсвечен элемент "Our pets".
        + Нажатие на About the shelter перебрасывает нас на страницу main.
        + Нажатие на Help the shelter перебрасывает нас на блок Help, расположенный на странице main.
        + Нажатие на Contacts перебрасывает нас на блок Footer, расположенный на этой же странице.
        + Логотип состоит из текстовых элементов. Нажатие на логотип перебрасывает нас на страницу main.
        + На странице единственный элемент <h1> — с текстом "Cozy House" в логотипе.
        + Хедер является "липким". При скролле он всегда показан на странице сверху, сохраняя свою позицию.
    * Our Friends +20
        + Четырёхколоночный блок с карточками, сеточная структура соответствует макету.
        + Карточки с питомцами интерактивны. Наведение на карточку меняет курсор, делает подсветку кнопки Learn more и меняет фон.
        + Пагинация интерактивна на доступных кнопках. Серые кнопки имеют специальный класс-модификатор.
    * Footer +10
        + При нажатии на email или иконку открывается почтовый сервис.
        + При нажатии на телефон или иконку открывается набор номера.
        + При нажатии на локации открывается google maps.
        + Изображение собаки, адреса и контакты — разные блоки, блоки спозиционированы согласно макету.
        + Фон выполнен с использованием градиента.

Вёрстка, ссылки и интерактивность проверялись в двух браузерах (Chrome, Firefox).
Вёрстка должна полностью соответстовать макету, максимальные расхождения составляют 1-2 пикселя.
Спасибо за проверку работы!`);